Talk(0, "哎，我說那些個俠客們，隨手一掌，能開碑裂石，輕輕一躍，便有數丈遠近。難道他們都吃了什麼靈丹妙藥，還是練了什麼仙術妖法不成？", "酒客甲", 11, 1, 0);
Talk(0, "嘿嘿，你這就孤陋寡聞了吧？人家武林中人，練的就是內力，開碑裂石，飛檐走壁，對身懷高深內功之人來說，只不過小事一樁。", "酒客乙", 11, 1, 0);
Talk(0, "嘖嘖，這內力真有這麼神奇？那他們的內力，都是從哪裡來的？別要告訴我，是打娘胎裡帶出來的罷？", "酒客甲", 11, 1, 0);
Talk(0, "哈哈，自然不是。我聽說不少門派都有一門^2打坐吐納^^的功夫，依照一定法門呼吸運氣，內力自生。而內力耗盡之時，也可用這法門恢復，只是對體力消耗也是頗大。", "酒客乙", 11, 1, 0);
Talk(0, "他奶奶的，體力算什麼，老子有的是氣力，老兄，快告訴我，哪裡可以學到這法門？", "酒客甲", 11, 1, 0);
Talk(0, "咳，哪有這般容易。各門各派對自家武功都是敝帚自珍，若輕易讓人學去，那江湖上不到處都是內家高手了？", "酒客乙", 11, 1, 0);
Talk(0, "唉，說得也是，算了，喝酒，喝酒。", "酒客甲", 11, 1, 0);
exit();
