Talk(0, "陳總舵主，我受丐幫一位長老所託，想去京城皇宮天牢營救他們的分舵舵主范興漢，上回您曾言道韋大嬸的兒子韋小寶在宮中當差，不知可否請他相助在下救人？", -2, 0, 0, 0);
Talk(40, "既是丐幫的好漢，我會中人自然義不容辭。", -2, 1, 0, 0);
Talk(0, "那我們現在就動身去京城找小寶，如何？", -2, 0, 0, 0);
Talk(40, "小寶在宮中，只怕要見他還要費些周折。這樣吧，我們先去京城我會沿途用暗號通知會中弟兄與小寶聯繫，讓他先出宮來與我們商量對策。京城的分舵設在一家^2藥鋪^^內，到時見了小寶，我們再商量如何救人。", -2, 1, 0, 0);
Talk(0, "好，那我們即刻動身。", -2, 0, 0, 0);
instruct_50(43, 0, 209, 40, 1, 0, 0);
ModifyEvent(15, 20, 1, 0, 740, 0, 0, 7092, 7092, 7092, 0, -2, -2);
ModifyEvent(105, 0, 1, 0, 1151, 0, 0, 5106, 5116, 5106, 0, -2, -2);
exit();
