if InTeam(25) == true then goto label0 end;
    Talk(126, "藥王傳人？那就有勞少俠了。", -2, 0, 0, 0);
    exit();
::label0::
    Talk(0, "苗大俠，這位程姑娘正是毒手藥王的衣鉢傳人。", -2, 0, 0, 0);
    Talk(126, "哦？", -2, 1, 0, 0);
    Talk(25, "待我看看，這是斷腸草之毒。雖然麻煩，卻也難不倒我，苗大俠，請你放鬆全身穴道。", -2, 0, 0, 0);
    Talk(0, "是了，勞煩姑娘。", -2, 1, 0, 0);
    Talk(25, "好啦，苗大俠。", -2, 0, 0, 0);
    Talk(126, "多謝姑娘相救之恩。", -2, 1, 0, 0);
    Talk(25, "三天之後，待得疼痛過去，麻養難當之時，揭開布帶，那便沒事了。眼下卻還見不得光。", -2, 0, 0, 0);
    instruct_50(43, 0, 1116, 0, 0, 0, 0);
exit();
