Talk(126, "胡斐，準備好了嗎？", -2, 0, 0, 0);
if InTeam(6) == true then goto label0 end;
    exit();
::label0::
    if AskBattle() == true then goto label1 end;
        exit();
::label1::
        SetAttribute(126, 0, 0, 40, 0);
        if TryBattle(122) == true then goto label2 end;
            LightScene();
            Talk(126, "你再回去好好琢磨琢磨。", -2, 1, 0, 0);
            exit();
::label2::
            instruct_50(43, 0, 380, 6, 43, 0, 0);
            instruct_50(43, 0, 380, 6, 52, 0, 0);
            LightScene();
            Talk(126, "哈哈？蓄勢已發二十年的一劍，今日終於有了結果。胡家刀法，果然了得，小胡斐，你替你爹報仇，一刀砍下來吧。", -2, 0, 0, 0);
            Talk(6, "兄弟，我們走吧，胡苗兩家的恩怨至此，已經了解了。", -2, 1, 0, 0);
            Talk(126, "你不殺我？", -2, 0, 0, 0);
            Talk(6, "家父與你只是純武學上的切磋，無怨亦無恨，他的死完全是被奸人所害，與你無關。如今惡人已經伏法，我只是替家父完成昔日未完的一戰，僅此而已。", -2, 1, 0, 0);
            Talk(422, "好，這才是我認識的胡大哥。", -2, 0, 0, 0);
            Talk(126, "胡一刀有子如此，九泉之下，也該瞑目了。這把寶刀名為冷月，是一把適合你的寶刀，就送給你吧，希望你今後能持此刀，多行善事。", -2, 1, 0, 0);
            Talk(6, "好一把冷月寶刀，多謝苗大俠。", -2, 0, 0, 0);
            Talk(422, "有了此刀，胡大哥今後可謂是如虎添翼了。", -2, 1, 0, 0);
            Talk(6, "是如狐添翼吧。", -2, 0, 0, 0);
            Talk(422, "哈哈哈哈哈。", -2, 1, 0, 0);
            GetItem(43, 1);
            ModifyEvent(67, 0, 1, 0, 1123, 0, 0, 5216, 5216, 5216, 0, -2, -2);
exit();
