Talk(126, "讓我看看你的武功進境如何了。", -2, 0, 0, 0);
Talk(0, "好，苗大俠，請賜招。", -2, 1, 0, 0);
SetAttribute(126, 0, 0, 40, 0);
if TryBattle(123) == true then goto label0 end;
    LightScene();
    Talk(126, "看來少俠尚需磨練啊……", -2, 0, 0, 0);
    exit();
::label0::
    LightScene();
    Talk(126, "好，我果然沒有看錯人，這就傳你苗家劍法。這招是沖天掌蘇秦背劍，這招是洗劍懷中抱月，這是迎門腿反劈華山，這是提撩劍白鶴舒翅…………", -2, 1, 0, 0);
    Talk(0, "這苗家劍法果然精妙無比啊。", -2, 0, 0, 0);
    Talk(126, "苗家劍法的精要你已經領悟了，今後只要你勤加修習，成就絕不在我之下。", -2, 1, 0, 0);
    Talk(422, "多謝苗大俠授藝。", -2, 0, 0, 0);
    Talk(126, "又來了，跟我那麼客氣幹什麼。", -2, 1, 0, 0);
    Talk(422, "哈哈，習慣了。", -2, 0, 0, 0);
    GetItem(106, 1);
    ModifyEvent(67, 0, 1, 0, 1125, 0, 0, 5216, 5216, 5216, 0, -2, -2);
exit();
