Talk(412, "奚長老，你跟吳……吳大哥到底為什麼打起來？你說什麼韃子鷹犬？", -2, 0, 0, 0);
Talk(0, "吳六奇……那吳六奇自聚賢莊離了丐幫，不思潔身自好，報效國家；反而去投了韃子，壞我社稷！他既然出身於丐幫，我丐幫自是不能袖手旁觀。我自關內北上至此，好容易逮到了這個機會，不想……唉……", "奚長老", 1, 1, 0);
Talk(0, "＜奚長老……＞", -2, 0, 0, 0);
DarkScene();
ModifyEvent(105, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
ModifyEvent(105, 46, 1, 0, 1237, 0, 0, 7112, 7112, 7112, 0, -2, -2);
LightScene();
if InTeam(40) == false then goto label0 end;
    Talk(40, "奚長老既然如此憤慨，想來曾對吳六奇抱有極大期望，否則也不致失態若此。", -2, 1, 0, 0);
    Talk(420, "是了，當日在杏子林與聚賢莊，吳大哥昂藏不屈，甘冒眾怒。端的是一位熱血男兒，怎會做出這棄家叛國之事？我定要去尋個明白。", -2, 0, 0, 0);
    exit();
::label0::
    Talk(420, "吳大哥大好男兒，怎麼會甘為韃子的走狗？我定要去尋個明白。", -2, 1, 0, 0);
exit();
