Talk(107, "&&少俠，好久不見啊。", -2, 0, 0, 0);
if InTeam(14) == true then goto label0 end;
    exit();
::label0::
    Talk(14, "老頭子，你居然違背我的話，沒有殺令狐冲", -2, 1, 0, 0);
    Talk(107, "聖姑，屬下無能，甘願受聖姑處罰", -2, 0, 0, 0);
    Talk(14, "現在我給你一個機會，幫我去完成一件事，事成後就當是你將功贖罪了。", -2, 1, 0, 0);
    Talk(107, "屬下遵命。", -2, 0, 0, 0);
    DarkScene();
    ModifyEvent(69, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    LightScene();
    instruct_50(43, 0, 209, 103, 2, 0, 0);
    instruct_50(43, 0, 228, 103, 107, 0, 0);
    ModifyEvent(16, 57, 1, 0, 803, 0, 0, 7120, 7120, 7120, 0, -2, -2);
    SetSceneMap(0, 0, 0, 0, 0);
exit();
