Talk(412, "大師？", -2, 0, 0, 0);
Talk(69, "（笑而不語）", -2, 1, 0, 0);
instruct_50(17, 0, 0, 166, 70, 0, 0);
instruct_50(4, 0, 2, 0, 10, 0, 0);
if CheckJumpFlag() == true then goto label0 end;
    instruct_50(3, 0, 0, 0, 0, 1, 0);
    instruct_50(16, 4, 0, 166, 70, 0, 0);
    exit();
::label0::
    Talk(0, "（笑而不語）", -2, 0, 0, 0);
    Talk(69, "呵呵……", -2, 1, 0, 0);
    GetItem(258, 1);
    Talk(415, "＜@#%&，傻笑了半天就給個破袋子。咦？這不就是那天裝張教主的那個？＞", -2, 0, 0, 0);
    ModifyEvent(39, 3, 1, 0, 1402, 0, 0, 7300, 7300, 7300, 0, -2, -2);
exit();
