Talk(71, "少俠是否想再與老夫練練這新棋？", -2, 0, 0, 0);
Talk(0, "不錯。", -2, 1, 0, 0);
instruct_50(43, 0, 236, 3, 4460, 1, 0);
if CheckJumpFlag() == true then goto label0 end;
    Talk(424, "看來我天生就不是摸棋子的料……", -2, 0, 0, 0);
    Talk(71, "剛開始學嘛，都是這樣的，少俠有空時，可以再來一局玩玩。", -2, 1, 0, 0);
    exit();
::label0::
    Talk(71, "少俠真是天資聰穎，一點即通，老夫佩服，佩服！", -2, 0, 0, 0);
    Talk(0, "先生過獎了。其實若是無人陪先生對弈，在下倒有個主意，不如先生隨我回歸雲莊，那裡有許多朋友都可以陪先生下棋，不知先生意下如何？", -2, 1, 0, 0);
    Talk(71, "有棋伴可尋，當然好了！這棋子為水晶切割而成，今日就送給少俠，或許日後有些用處。", -2, 0, 0, 0);
    DarkScene();
    ModifyEvent(5, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    LightScene();
    instruct_50(43, 0, 209, 71, 2, 0, 0);
    instruct_50(43, 0, 228, 71, 71, 0, 0);
    ModifyEvent(15, 44, 1, 0, 768, 0, 0, 7042, 7042, 7042, 0, -2, -2);
    GetItem(246, 1);
exit();
