instruct_50(20, 0, 5, 100, 0, 0, 0);
instruct_50(4, 0, 0, 100, 3, 0, 0);
if CheckJumpFlag() == true then goto label0 end;
    Talk(0, "薛神醫，黑玉斷續膏我找來了。", -2, 0, 0, 0);
    Talk(77, "太好了，找機會試試這藥的效力。那我就依你所言，去歸雲莊。對了，這“昴日金針”送給你，日後也許有些用處。", -2, 0, 0, 0);
    DarkScene();
    ModifyEvent(85, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    LightScene();
    instruct_50(43, 0, 209, 55, 1, 0, 0);
    instruct_50(43, 0, 228, 55, 77, 0, 0);
    ModifyEvent(15, 32, 1, 0, 774, 0, 0, 6418, 6418, 6418, 0, -2, -2);
    GetItem(249, 1);
    AddItem(5, -1);
    exit();
::label0::
    Talk(77, "唉，要是有隻兔子跑過來撞在這柱子上暈了，我就有的治了……", -2, 0, 0, 0);
    Talk(0, "………………", -2, 1, 0, 0);
exit();
