if HaveItem(44) == true then goto label0 end;
    Talk(82, "我錯了，我真的錯了……", -2, 0, 0, 0);
    Talk(0, "………………", -2, 1, 0, 0);
    exit();
::label0::
    Talk(82, "我的刀，這真是我的刀！少俠大恩大德……", -2, 1, 0, 0);
    Talk(0, "大恩大德倒不至於，不過我倒確實有點事，就是想請你與我們一道對付魔教，抵禦外族，你意下如何？", -2, 0, 0, 0);
    Talk(82, "少俠幫了我如此大忙，自當任憑驅策。", -2, 1, 0, 0);
    DarkScene();
    ModifyEvent(100, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    LightScene();
    instruct_50(43, 0, 209, 79, 1, 0, 0);
    instruct_50(43, 0, 228, 79, 82, 0, 0);
    ModifyEvent(16, 46, 1, 0, 779, 0, 0, 7022, 7022, 7022, 0, -2, -2);
exit();
