Talk(79, "我再來彈奏幾曲，你可以用心感受一下，曲中表現了什麼情景？", -2, 0, 0, 0);
instruct_50(43, 0, 251, 0, 0, 0, 0);
instruct_50(4, 0, 2, 28929, 1, 0, 0);
if CheckJumpFlag() == true then goto label0 end;
    Talk(79, "唉……當路誰當假，知音世所稀，真是一點都不假……", -2, 0, 0, 0);
    Talk(0, "先生請見諒，晚輩確實不通此道。", -2, 1, 0, 0);
    exit();
::label0::
    Talk(79, "少俠果然有慧根，看來這世間還是有人能解我的琴聲，甚善……", -2, 0, 0, 0);
    Talk(0, "先生過獎，我也有幾個長於音律的朋友，不知您可願隨我回歸雲莊，與他們共同參詳這本曲譜，再譜當世絕響？", -2, 1, 0, 0);
    Talk(79, "少俠如此好意邀請，我又怎能推辭。這“冰蠶絲”是我尋來做琴絃剩下的，是罕有的柔韌之物，送與少俠，或許日後有用。", -2, 0, 0, 0);
    DarkScene();
    ModifyEvent(68, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    LightScene();
    instruct_50(43, 0, 209, 76, 2, 0, 0);
    instruct_50(43, 0, 228, 76, 79, 0, 0);
    ModifyEvent(16, 62, 1, 0, 776, 0, 0, 7050, 7050, 7050, 0, -2, -2);
    GetItem(245, 1);
exit();
