Talk(43, "嘶～好冷，好冷……", -2, 0, 0, 0);
Talk(412, "韋蝠王，你這是……", -2, 1, 0, 0);
Talk(43, "好冷……好冷……", -2, 0, 0, 0);
Talk(415, "唉，看來要找個大夫看看才行。", -2, 1, 0, 0);
if InTeam(77) == false then goto label0 end;
    Talk(77, "唔……蝠王這是修煉寒冰綿掌出了岔子，傷了三陰脈絡，導致寒氣鬱積於經脈之中，故而如此。", -2, 0, 0, 0);
    Talk(0, "那可是有救？", -2, 1, 0, 0);
    Talk(77, "自然，萬物皆有生克。寒毒鬱積，可以燥熱陽氣衝擊經脈，化解寒毒。", -2, 0, 0, 0);
    Talk(412, "那……這陽氣又從何而來？", -2, 1, 0, 0);
    Talk(77, "方法有二：一者可尋一修煉純陽真氣之高手，以精元療毒；可是這寒毒不同於一般傷患，須得這高手精通醫術，方能因勢利導，見機行事。可這世上修煉純陽真氣，又肯消耗精元救人的高手本就稀少，更遑論精通醫術之人？這二嘛……便是以至陽之物入藥，再配以我的醫術，也可痊癒。", -2, 0, 0, 0);
    Talk(415, "那所謂“至陽之物”，又是什麼？", -2, 1, 0, 0);
    Talk(77, "天下奇物不知凡幾，不過據我所知，遼東有一物名“火蟾”，當有此效。", -2, 0, 0, 0);
    Talk(0, "韋幅王且暫忍苦楚，待我去遼東取火蟾為你療毒。", -2, 1, 0, 0);
    Talk(43, "嘶~那……謝……小兄弟……", -2, 0, 0, 0);
    ModifyEvent(95, 141, 1, 0, 1393, 1394, 0, 5326, 5326, 5326, 0, -2, -2);
    exit();
::label0::
    if InTeam(25) == false then goto label1 end;
        Talk(25, "這是寒毒。", -2, 1, 0, 0);
        Talk(0, "寒毒？程姑娘似乎胸有成竹……", -2, 0, 0, 0);
        Talk(25, "寒毒鬱積於靜脈，若以陽氣衝緩，當可治癒。根據《藥王神篇》記載，遼東有火蟾，性燥熱。有了它，蝠王的寒毒應當無礙。", -2, 1, 0, 0);
        Talk(0, "韋幅王且暫忍苦楚，待我去遼東取火蟾為你療毒。", -2, 0, 0, 0);
        Talk(43, "嘶~那……謝……小兄弟……", -2, 1, 0, 0);
        ModifyEvent(95, 141, 1, 0, 1393, 1394, 0, 5326, 5326, 5326, 0, -2, -2);
::label1::
exit();
