Talk(101, "“辭別了二爹娘汴梁城奔”——你現在可知道這句話出自哪部戲曲了？", -2, 0, 0, 0);
instruct_50(43, 0, 351, 9623, 3, 0, 0);
instruct_50(4, 0, 2, 28931, 2, 0, 0);
if CheckJumpFlag() == true then goto label0 end;
    Talk(101, "看來你對戲文的造詣還是不夠……不妨事，你以後知道了再告訴我也是可以的。", -2, 1, 0, 0);
    Talk(413, "在下孤陋寡聞，請先生見諒。", -2, 0, 0, 0);
    exit();
::label0::
    Talk(101, "咦，看不出你還是個行家呢？現在愛聽戲的年輕人可是越來越不多了……", -2, 1, 0, 0);
    Talk(0, "先生平日一人唱戲卻沒人聽，未免冷清，不如先生隨我回歸雲莊，那裡有許多江湖朋友，一定不少人喜歡聽先生的戲。", -2, 0, 0, 0);
    Talk(101, "也好。喏，這“玳帽簪”送給你，以後或許有些用處。", -2, 1, 0, 0);
    DarkScene();
    ModifyEvent(19, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    LightScene();
    instruct_50(43, 0, 209, 98, 2, 0, 0);
    instruct_50(43, 0, 228, 98, 101, 0, 0);
    ModifyEvent(16, 63, 1, 0, 1587, 0, 0, 7046, 7046, 7046, 0, -2, -2);
    GetItem(252, 1);
exit();
