Talk(347, "“八卦佈列曜，運移不失中，元精眇難睹，推度效符證。”師父說，道經劍術，兩手都要抓，兩手都要硬。現在道經我已背得滾瓜爛熟，可是這劍術……諸位師兄也都是一知半解。如何是好，如何是好？", -2, 0, 0, 0);
Talk(0, "（道經？）這位兄臺，既然你書已然背熟，那可否借在下一用？", -2, 1, 0, 0);
Talk(347, "本來嘛，一本書而已，沒什麼大不了的。只是最近無人與我對練，師父又要考驗我劍術進境。沒人對練，我劍術自然不會長進；劍術不會長進，師父就會責罰；師父責罰，我就不爽；心情不爽……", -2, 0, 0, 0);
Talk(0, "（就不給我書看是吧？）好了好了，我陪你練就是。", -2, 1, 0, 0);
Talk(347, "那我可有言在先，切磋修為，切勿傷人。", -2, 0, 0, 0);
if TryBattle(188) == true then goto label0 end;
    LightScene();
    Talk(347, "經此一戰，我似乎有些領悟。兄臺辛苦了，這幾粒丹藥，也一併收下吧。", -2, 0, 0, 0);
    GetItem(265, 1);
    GetItem(3, 10);
    ModifyEvent(51, 13, 1, 0, 1323, 0, 0, 6106, 6106, 6106, 0, -2, -2);
    exit();
::label0::
    LightScene();
    Talk(347, "也罷也罷，是我自家本事不濟，怨不得他人，道書便給你吧。", -2, 1, 0, 0);
    GetItem(265, 1);
    ModifyEvent(51, 13, 1, 0, 1324, 0, 0, 6106, 6106, 6106, 0, -2, -2);
exit();
