if UseItem(262) == true then goto label0 end;
    exit();
::label0::
    Talk(64, "好香好香，這才是上等的香肉麼，這味兒，這口感，那叫一沒話說啊。小子，看你這麼殷勤，是受了什麼欺負吧？老周我不好白吃你的狗肉。這樣，你想打誰，說出來，我幫你打他。", -2, 0, 0, 0);
    Talk(0, "晚輩欲邀周……先生共抗外族。", -2, 1, 0, 0);
    Talk(64, "成，打誰不是個打？老周我就隨你去吧。", -2, 0, 0, 0);
    DarkScene();
    ModifyEvent(3, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    LightScene();
    AddItem(262, -1);
    instruct_50(43, 0, 209, 61, 1, 0, 0);
    instruct_50(43, 0, 228, 61, 64, 0, 0);
    ModifyEvent(15, 25, 1, 0, 761, 0, 0, 7308, 7308, 7308, 0, -2, -2);
exit();
