Talk(1, "“北方有佳人，絕世而獨立。一顧傾人城，再顧傾人國……”", "酒客甲", 0, 1, 0);
Talk(1, "文人騷客，總喜歡誇大其詞，區區一個女子，又怎能傾城傾國？", "酒客乙", 1, 1, 0);
Talk(1, "傾國傾城，傾國傾城……世上有無這種女子，我是不知道，可是我卻聽過一個^2傾國傾城^^的武林傳說。", "酒客甲", 0, 1, 0);
Talk(1, "雖說武林口口相傳，未必可信。不過老哥你的消息，向來是沒什麼差錯的。", "酒客乙", 1, 1, 0);
Talk(1, "當不起，這我就是一說，你聽聽也就算了。", "酒客甲", 0, 1, 0);
Talk(1, "反正是喝酒助興，又有何妨？", "酒客乙", 1, 1, 0);
Talk(1, "傳說中確實有“傾國傾城”的絕美女子，凡是幫助她的人，無不倍添氣力；而與她為敵的人，都會虛弱不堪……這當真是連我自己都不信了。", "酒客甲", 0, 1, 0);
Talk(1, "這聽起來已經不像人間手段，卻是有些近乎妖法，有趣。喝酒喝酒。", "酒客乙", 1, 1, 0);
exit();
