Talk(1, "十幾年前王盤山那事聽過沒有？", "酒客甲", 0, 1, 0);
Talk(1, "聽過啊，當年天鷹教得了屠龍寶刀，在那王盤山廣邀各派，揚刀立威，不想屠龍刀反被謝遜奪去。是吧？", "酒客乙", 1, 1, 0);
Talk(1, "沒錯，不過你想沒想過，當時王盤山上有幾百號人，謝遜就算一個個砍，也得弄得筋疲力盡。可他卻奪得寶刀，揚長而去。這奇不奇怪？", "酒客甲", 0, 1, 0);
Talk(1, "這……嘿，我還真沒想過。", "酒客乙", 1, 1, 0);
Talk(1, "我教你個乖，世上有人內力強勁，可^2聲震雷霆^^，以吼聲傷敵於無形。當初謝遜就是一聲大吼，傷人無數，才得以奪刀而去。", "酒客甲", 0, 1, 0);
Talk(1, "吼聲傷人，這也忒嚇人。", "酒客乙", 1, 1, 0);
Talk(1, "那是。我再教你個乖，你看到這種人時，可千萬不要靠近。這吼聲不分敵我，無論場內是誰，都要為其所傷。", "酒客甲", 0, 1, 0);
Talk(1, "行走江湖，這種人可得小心。", "酒客乙", 1, 1, 0);
exit();
