b=getsceneeventpro(105,91,4);
if b==0 then
	Talk(448, "這位玩家，來買上等好豬肉哦。", "豬鐵蛋",1, 0, 0);
	a=getsceneeventpro(15,8,2);
	if a>0 then
		Talk(0, "等等！你稱呼我為“玩家？”", -2, 0, 0, 0);
		Talk(448, "嗯，怎麼？有啥不對麼？","豬鐵蛋",1, 0, 0);
		Talk(0, "啊，總覺得哪裡不對……", -2, 0, 0, 0);
		Talk(448, "每個遊戲不是都有一個這樣的人物麼？","豬鐵蛋", 1, 0, 0);
		Talk(0, "那你是？", -2, 0, 0, 0);
		Talk(448, "我就是偉大的豬帝，負責統領這個世界！","豬鐵蛋", 1, 0, 0);
		Talk(0, "…………（&%%￥#*&）", -2, 0, 0, 0);
		Talk(448, "既然你找到了我，也不能讓你空手而回，這些材料給你吧。","豬鐵蛋", 1, 0, 0);
		Talk(0, "啊，謝謝豬帝。", -2, 0, 0, 0);
		getitem(223,2);
		getitem(224,2);
		getitem(225,2);
		putsceneeventpro(1,105,91,4);
	end
	exit();
else
	Talk(448, "怎麼樣？&&玩家，遊戲還順利嗎，有任何問題或建議歡迎到www.txdx.net討論。做中國人自己的單機武俠遊戲。","豬鐵蛋", 1, 0, 0);
end
exit();
