ModifyEvent(3, 71, 2,1859);
Talk(0, "少年人，你終於來了。", "黃逆乾", 1, 1, 0);
Talk(0, "（依我的經驗，說這話的人都不簡單）", -2, 0, 0, 0);
Talk(0, "沒錯，我是黃逆乾。", "黃逆乾", 1, 1, 0);
Talk(0, "你怎知道我在想什麼……（黃逆乾黃逆乾，這名字怎麼這麼熟悉）！", -2, 0, 0, 0);
Talk(0, "你知道佛山武功最出名的是什麼嗎？", "黃逆乾", 1, 1, 0);
Talk(0, "這我知道，自然是黃飛鴻的佛山無影腳。", -2, 0, 0, 0);
Talk(0, "我就是黃飛鴻的傳人。", "黃逆乾", 1, 1, 0);
Talk(0, "哇，名門之後耶……", -2, 0, 0, 0);
Talk(0, "只要你猜對這個廣東話謎語，我就傳你佛山無影腳。", "黃逆乾", 1, 1, 0);
Talk(0, "= =！好吧。", -2, 0, 0, 0);
a=-1;
while a<0 do
    clear();
    showstringwithbox(10, 10, '牛不耕田。（打一外邦名字）');
    a=menu(4, 10, 40, 100, {'吉隆坡','新加坡','馬尼拉','曼谷'});
end
if a==2 then
    Talk(0, "少年人，不錯，這就是佛山無影腳的基本功夫。", "黃逆乾", 1, 1, 0);
    Talk(0, "謝謝黃大大。", -2, 0, 0, 0);
    ShowTitle("全隊輕功增加10。", 1);
    for i=0,5 do
        b=getmember(i);
        if b>=0 then
            putrolepro(getrolepro(b, 44) + 10, b, 44);
        end
    end
else
    Talk(0, "少年人，這可不對哪，看來我們無緣。", "黃逆乾", 1, 1, 0);
    Talk(0, "……", -2, 0, 0, 0);
end
