--instruct_50(43, 0, 351, 363, 4, 0, 0);
--instruct_50(4, 0, 2, 28931, 1, 0, 0);
showstringwithbox(10, 10, '你想學哪種武功？');
pause();
a=-1;
while a<0 do
    a=menu(4, 10, 40, -1, {'南山刀法', '越女劍法', '碧波掌法', '柯氏降魔杖'});
end
if a==3 then
    Talk(369, "嘿嘿，小子，有眼光！我就把我家傳的柯氏降魔杖傳授給你！", -2, 0, 0, 0);
    instruct_50(17, 0, 0, 0, 106, 10, 0);
    instruct_50(3, 0, 0, 10, 10, 10, 0);
    instruct_50(16, 4, 0, 0, 106, 10, 0);
    instruct_50(43, 0, 231, 0, 91, 2, 0);
    instruct_50(0, 0, 0, 0, 0, 0, 0);
    instruct_50(4, 0, 5, 0, 1, 0, 0);
    else if a==2 then
        Talk(242, "哈哈，你很會挑師父嘛！這套碧波掌，是我桃花島的入門武功，就傳給你吧！", -2, 0, 0, 0);
        instruct_50(17, 0, 0, 0, 100, 10, 0);
        instruct_50(3, 0, 0, 10, 10, 10, 0);
        instruct_50(16, 4, 0, 0, 100, 10, 0);
        instruct_50(43, 0, 231, 0, 1, 2, 0);
        instruct_50(0, 0, 0, 0, 0, 0, 0);
        instruct_50(4, 0, 5, 0, 1, 0, 0);
        else if a==1 then
            Talk(2, "好孩子，這套越女劍法，是靖哥哥的七師父韓小瑩留下來的，我就傳授與你吧！", -2, 0, 0, 0);
            instruct_50(17, 0, 0, 0, 102, 10, 0);
            instruct_50(3, 0, 0, 10, 10, 10, 0);
            instruct_50(16, 4, 0, 0, 102, 10, 0);
            instruct_50(43, 0, 231, 0, 36, 2, 0);
            instruct_50(0, 0, 0, 0, 0, 0, 0);
            instruct_50(4, 0, 5, 0, 1, 0, 0);
        else 
            Talk(1, "我四師父的這套南山刀法，法度嚴謹，是刀法入門之基礎，我就傳授給你吧！", -2, 0, 0, 0);
            instruct_50(17, 0, 0, 0, 104, 10, 0);
            instruct_50(3, 0, 0, 10, 10, 10, 0);
            instruct_50(16, 4, 0, 0, 104, 10, 0);
            instruct_50(43, 0, 231, 0, 66, 2, 0);
        end
    end
end
GetItem(62, 1);
GetItem(88, 1);
GetItem(113, 1);
GetItem(135, 1);
GetItem(161, 1);
