Talk(416, "叫鳳天南出來，小爺我今天來拔他的鳳毛。", -2, 0, 0, 0);
Talk(355, "哪裡來的小子，敢到鳳老爺家來撒野。", -2, 1, 0, 0);
if TryBattle(2) == true then goto label0 end;
    Dead();
    exit();
::label0::
    LightScene();
    Talk(416, "說，鳳天南在哪裡？", -2, 0, 0, 0);
    Talk(355, "大俠饒命，大俠饒命，我家老爺和幾個客人剛才往北帝廟去了。", -2, 1, 0, 0);
    Talk(415, "他去北帝廟做什麼？", -2, 0, 0, 0);
    Talk(355, "小的也不清楚，老爺剛才還設宴款待幾個官爺，後來賭場兩個下人回來了，不知說了什麼，老爺一聽就立馬往北帝廟去了，幾位官爺也跟著去了。", -2, 1, 0, 0);
    Talk(425, "哼，我這就去北帝廟找他，你要是敢騙我，饒不了你。", -2, 0, 0, 0);
    Talk(355, "小人不敢，小人句句屬實。", -2, 1, 0, 0);
    instruct_50(21, 0, 3, 7, 2, 318, 0);
    instruct_50(21, 0, 3, 8, 2, 318, 0);
    ModifyEvent(3, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    ModifyEvent(3, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
exit();
