if UseItem(0) == true then goto label0 end;
    exit();
::label0::
    GetItem(0, -1);
    Talk(383, "謝客官打賞～啊，是了，小人想起來了。前些天城裡來了個外地胖子，看樣子是做生意的，出手很是闊綽，將^2城中那所大宅院^^租了下來，這兩日不斷有些北邊兒口音的人物出入。除此之外，小人再想不出別的啦。", -2, 1, 0, 0);
    Talk(0, "這就夠啦，多謝。", -2, 0, 0, 0);
    instruct_50(21, 0, 19, 10, 2, 324, 0);
    instruct_50(21, 0, 19, 17, 4, 502, 0);
    instruct_50(21, 0, 19, 23, 4, 502, 0);
    ModifyEvent(19, 18, 1, 0, 0, 0, 0, 7198, 7198, 7198, 0, -2, -2);
    ModifyEvent(19, 19, 1, 0, 505, 0, 0, 7184, 7184, 7184, 0, -2, -2);
    ModifyEvent(19, 10, 1, 0, 324, 0, 0, 8376, 8376, 8376, 0, -2, -2);
exit();
