instruct_50(5, 0, 0, 0, 0, 0, 0);
instruct_50(43, 0, 369, 300, 1797, 200, 200);
instruct_50(3, 0, 0, 100, 15205, 0, 0);
if UseItem(266) == false then goto label0 end;
    instruct_50(0, 101, 0, 0, 0, 0, 0);
    instruct_50(22, 0, 68, 36, 8, 102, 0);
::label0::
    if UseItem(267) == false then goto label1 end;
        instruct_50(0, 101, 1, 0, 0, 0, 0);
        instruct_50(22, 0, 84, 16, 8, 102, 0);
::label1::
        if UseItem(268) == false then goto label2 end;
            instruct_50(0, 101, 2, 0, 0, 0, 0);
            instruct_50(22, 0, 14, 39, 8, 102, 0);
::label2::
            if UseItem(269) == false then goto label3 end;
                instruct_50(0, 101, 3, 0, 0, 0, 0);
                instruct_50(22, 0, 13, 16, 8, 102, 0);
::label3::
                if UseItem(270) == false then goto label4 end;
                    instruct_50(0, 101, 4, 0, 0, 0, 0);
                    instruct_50(22, 0, 23, 1, 8, 102, 0);
::label4::
                    if UseItem(271) == false then goto label5 end;
                        instruct_50(0, 101, 5, 0, 0, 0, 0);
                        instruct_50(22, 0, 61, 64, 8, 102, 0);
::label5::
                        if UseItem(272) == false then goto label6 end;
                            instruct_50(0, 101, 6, 0, 0, 0, 0);
                            instruct_50(22, 0, 62, 5, 8, 102, 0);
::label6::
                            if UseItem(273) == false then goto label7 end;
                                instruct_50(0, 101, 7, 0, 0, 0, 0);
                                instruct_50(22, 0, 105, 80, 8, 102, 0);
::label7::
                                instruct_50(4, 0, 2, 102, 0, 0, 0);
                                if CheckJumpFlag() == true then goto label8 end;
                                    instruct_50(4, 1, 2, 100, 102, 0, 0);
                                    if CheckJumpFlag() == false then goto label9 end;
                                        instruct_50(3, 0, 0, 103, 101, 266, 0);
                                        instruct_50(17, 1, 1, 103, 188, 104, 0);
                                        instruct_50(4, 0, 2, 104, 1, 0, 0);
                                        if CheckJumpFlag() == true then goto label10 end;
                                            instruct_50(16, 1, 1, 103, 188, 1, 0);
                                            instruct_50(22, 0, 107, 0, 8, 104, 0);
                                            instruct_50(3, 0, 0, 104, 104, 1, 0);
                                            instruct_50(21, 8, 107, 0, 8, 104, 0);
                                            instruct_50(4, 0, 2, 104, 8, 0, 0);
                                            if CheckJumpFlag() == false then goto label11 end;
                                                instruct_50(23, 0, 107, 1, 40, 13, 0);
                                                instruct_50(23, 0, 107, 1, 39, 35, 0);
::label10::
::label11::
                                                instruct_50(3, 0, 0, 105, 101, 13335, 0);
                                                --instruct_50(32, 0, 105, 1, 0, 0, 0);
                                                print(getx50(101));
                                                i = getx50(101);
                                                if i==0 then
                                                    ShowTitle("每行第一個字，從右到左念，似乎有藏字：「大....清....入....關....為....防....漢....人....造....反....特....將....盡....數....寶....藏....置....於....某....處....以....備....不....時....之....需....零口口，口口口」", 1797);
                                                end
                                                if i==1 then
                                                    ShowTitle("每行最後一個字，從右到左念，似乎有藏字：「寶....藏....位....置....便....寫....於....四....十....二....章....經....中....分....作....八....本....交....與....八....旗....旗....主....保....管....口三口，口口口」", 1797);
                                                end
                                                if i==2 then
                                                    ShowTitle("每行中間的字，從右到左念，似乎有藏字：「寶....藏....祕....密....則....託....於....八....名....親....信....並....下....鄉....隱....居....傳....與....子....嗣....務....必....緘....守....以....延....千....世....口口七，口口口」", 1797);
                                                end
                                                if i==3 then
                                                    ShowTitle("從第一個字開始每隔十字，似乎有藏字：「即....便....探....得....寶....藏....之....處....亦....切....勿....洩....漏....倘....若....漢....人....造....反....而....心....生....退....路....則....大....清....休....矣....口口口，零口口」", 1797);
                                                end
                                                if i==4 then
                                                    ShowTitle("本頁開始每隔一頁第一個字，似乎有藏字：「此....寶....藏....不....僅....為....入....關....之....際....自....民....間....搜....刮....而....來....更....兼....前....朝....帝....室....大....批....之....珍....寶....口口口，口一口」", 1797);
                                                end
                                                if i==5 then
                                                    ShowTitle("本頁的對角，從右下到左上，似乎有藏字：「「此....書....落....於....民....家....小....居....中....乃....真....本....故....此....旗....主....所....持....乃....偽....本....並....無....任....何....蛛....絲....馬....跡....口口口，口口九」", 1797);
                                                end
                                                if i==6 then
                                                    ShowTitle("本頁的對角，從右上到左下，似乎有藏字：「埋....藏....入....口....有....厚....垣....遮....敝....現....之....不....易....謹....記....視....不....及....死....角....調....查....為....上....策」", 1797);
                                                end
                                                if i==7 then
                                                    ShowTitle("沒有規律的藏字：「埋....藏....點....不....止....一....處....尚....需....用....心....之....極....以....保....寶....藏....盡....數....取....得....使....我....族....人....衣....食....無....缺」", 1797);
                                                end
exit();
::label8::
::label9::
                                                ShowTitle("本頁為佛家思想的內容，沒有什麼特別的。", 1797);
exit();
