Talk(0, "薛神醫，這位姑娘的傷勢，還請你……", -2, 0, 0, 0);
Talk(77, "慢著，我早已說過了，這人是喬峰帶來的，如今他又殺傷無數武林豪傑，我豈能再為這小姑娘治傷！", -2, 1, 0, 0);
Talk(0, "薛神醫仁心仁術，妙手回春，路人皆知，我看神醫乃堂堂大丈夫，恩怨是非分明，即便要對付喬峰，也與這位阮姑娘無半點關係。薛先生方才那樣將對喬峰的恨意牽連到這無辜的小姑娘身上，豈是杏林之人所當為？", -2, 0, 0, 0);
Talk(77, "………小子，別以為你伶牙俐齒的，老夫就會上了你的道兒。不過你的話，也算有幾分歪理。老夫就給你一個機會。**想必你也知道，我給武林中人看一次病，便要學他一招功夫。如今這丫頭的傷還要麻煩些，這樣吧，最近老夫在研究毒術與醫術的生克，聞聽雲南五毒教至寶《五毒祕傳》對為毒術之尊，要是你能將這五毒祕傳給我，我便為她醫治。", -2, 1, 0, 0);
if HaveItem(72) == false then goto label0 end;
    instruct_50(43, 0, 351, 3421, 2, 0, 0);
    instruct_50(4, 0, 2, 28931, 2, 0, 0);
    if CheckJumpFlag() == true then goto label1 end;
        Talk(419, "五毒祕傳？巧了，在下碰巧有這東西。先生儘管拿去，只求您盡心盡力將阮姑娘的傷治好。", -2, 0, 0, 0);
        Talk(77, "！！！****你你你——**小子，想不到你真拿得出。老夫一言既出，就必會做到，你只管放心。", -2, 1, 0, 0);
        instruct_50(21, 0, 85, 1, 2, 694, 0);
        instruct_50(21, 0, 85, 2, 2, 695, 0);
        instruct_50(21, 0, 85, 5, 4, 696, 0);
        instruct_50(16, 0, 0, 166, 40, 1, 0);
        GetItem(72, -1);
        instruct_50(17, 0, 1, 72, 76, 0, 0);
        instruct_50(4, 0, 2, 0, -1, 0, 0);
        if CheckJumpFlag() == true then goto label2 end;
            instruct_50(16, 1, 0, 0, 122, -1, 0);
            instruct_50(16, 1, 0, 0, 124, 0, 0);
            instruct_50(16, 0, 1, 72, 76, -1, 0);
::label2::
            ModifyEvent(57, 66, 1, 0, 1620, 0, 0, 8566, 8566, 8566, 0, -2, -2);
            exit();
::label1::
::label0::
            Talk(415, "五毒祕傳？聽著倒是耳熟，但五毒教的東西，我現在怎麼會有？先生可否寬限數日……", -2, 0, 0, 0);
            Talk(77, "（不耐煩道）既是沒有，那就再也休提此事。你快快離開吧！", -2, 1, 0, 0);
            instruct_50(21, 0, 85, 1, 2, 692, 0);
            instruct_50(21, 0, 85, 2, 2, 693, 0);
            instruct_50(21, 0, 85, 5, 4, 696, 0);
            ModifyEvent(57, 66, 1, 0, 1620, 0, 0, 8566, 8566, 8566, 0, -2, -2);
exit();
