if InTeam(54) == true then goto label0 end;
    Talk(55, "不知道余師兄他怎麼樣了……", -2, 1, 0, 0);
    exit();
::label0::
    Talk(54, "師妹？你怎麼回來了？", -2, 1, 0, 0);
    Talk(55, "是師父帶我回來的，四師伯已經把你的事都告訴我啦。嘻嘻，殺韃子的事，怎能少了我？", -2, 1, 0, 0);
    Talk(54, "這……", -2, 1, 0, 0);
    Talk(422, "李姑娘機變過人，武功也是不弱，能得姑娘幫忙，實是我們的榮幸。余兄弟，你說是不是？", -2, 0, 0, 0);
    Talk(54, "咳……正是。", -2, 1, 0, 0);
    DarkScene();
    ModifyEvent(54, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    LightScene();
    ModifyEvent(16, 42, 1, 0, 755, 0, 0, 7174, 7174, 7174, 0, -2, -2);
    instruct_50(43, 0, 209, 65, 1, 0, 0);
    instruct_50(43, 0, 228, 65, 55, 0, 0);
    GetItem(95, 1);
exit();
