Talk(0, "桃花島&&，見過殷六俠。", -2, 0, 0, 0);
Talk(284, "原來是&&少俠。少俠來到武當，不知有何要事？", -2, 1, 0, 0);
Talk(0, "在下只是路過，想著來拜會張真人和諸位，並無什麼特別要事。", -2, 0, 0, 0);
Talk(284, "呵呵，那少俠就請自己隨意轉轉，今日還要練劍，恕殷某不能相陪了。", -2, 1, 0, 0);
Talk(0, "不敢，殷六俠請。", -2, 0, 0, 0);
if InTeam(55) == false then goto label0 end;
    Talk(55, "師父，徒兒也回來啦。", -2, 1, 0, 0);
    Talk(284, "&&少俠，小徒沅芷沒給你添什麼麻煩吧？", -2, 1, 0, 0);
    Talk(413, "咳咳……當然沒有……", -2, 0, 0, 0);
    Talk(55, "師——父——", -2, 1, 0, 0);
    Talk(284, "咳咳，為師可是什麼也沒說。時候不早了，你們也該下山了。", -2, 1, 0, 0);
::label0::
exit();
