Talk(65, "師父……師兄……你們死的好慘啊", -2, 1, 0, 0);
Talk(412, "老伯，你的師父和師兄都不在了嗎？", -2, 0, 0, 0);
Talk(65, "呼！惡僧，你殺了師父和師兄，我跟你拼了！看我的一陽指！", -2, 1, 0, 0);
if TryBattle(109) == true then goto label0 end;
::label0::
    LightScene();
    Talk(412, "一陽指？唉，你可是武三通武三叔！", -2, 0, 0, 0);
    Talk(65, "武三通是誰啊，我不是武三通，我不配當武三通，我不是一燈大師的弟子，我不配啊！啊啊啊啊！", -2, 1, 0, 0);
    DarkScene();
    ModifyEvent(33, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2);
    ModifyEvent(18, 1, 1, 0, 962, 0, 0, 8874, 8874, 8874, 0, -2, -2);
    instruct_50(21, 0, 7, 7, 2, 961, 0);
    LightScene();
    Talk(425, "武三叔，你別跑啊，喂喂，是朱叔叔讓我來的，喂！唉，不行，他這瘋瘋癲癲的樣子我沒轍，必須得找個熟人來勸他。", -2, 0, 0, 0);
exit();
