Talk(6, "魔教妖邪，來我峨嵋山有何貴事．", 6, 0);
Talk(0, "上回看妳手中那把寶劍，寒芒吞吐，電閃星飛，想必就是傳說中的”倚天劍”？小俠我想向你借來用用．", 0, 1);
Talk(6, "光明頂上被你僥倖獲勝，你現在還敢來我峨嵋撒野，莫非真視我峨嵋無人．", 6, 0);
if AskBattle() == true then goto label0 end;
    Talk(0, "那裡，那裡．我只不過是來勸師太，與明教間的事能和就和．自古以來冤家宜解不宜結．", 0, 1);
    Talk(6, "閣下未免管的太多了吧，難道你真以為你是”武林盟主”嗎！", 6, 0);
    exit();
::label0::
    if TryBattle(20) == true then goto label1 end;
        Dead();
        exit();
::label1::
        LightScene();
        Talk(0, "寶劍還是應該配英雄，怎樣？師太，這”倚天劍”可以讓給我了吧．", 0, 1);
        Talk(6, "魔教妖孽，想從我滅絕手中拿走倚天劍，等下輩子吧！", 6, 0);
        PlayAnimation(2, 5468, 5496);
        ModifyEvent(-2, -2, -2, -2, 149, -1, -1, 5238, 5238, 5238, -2, -2, -2);
        Talk(77, "師父，師父！", 77, 0);
        Talk(0, "師太，師太！何苦如此呢？若真不想給我，跟我說一聲就行了．唉！", 0, 1);
        Talk(6, "魔教的淫徒，妳若玷污了我愛徒們的清白，我做鬼也不饒過．．．．．．．．你！", 6, 0);
        Talk(77, "師父，師父！可惡的魔教妖邪，替我師父嚐命來．", 77, 0);
        if TryBattle(21) == true then goto label2 end;
            Dead();
            exit();
::label2::
            LightScene();
            ModifyEvent(-2, 3, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(-2, 4, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(-2, 5, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(-2, 6, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(-2, 7, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(-2, 8, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(-2, 9, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
            ModifyEvent(-2, 10, -2, -2, 151, -1, -1, -2, -2, -2, -2, -2, -2);
            AddEthics(-5);
            AddRepute(8);
exit();
