Talk(43, "小子，你怎麼還活著？你沒去俠客島嗎？", 43, 0);
Talk(0, "去過了！俠客島上其實並不像外界所傳言的那麼可怕．島上其實藏有極大的武功秘密，許多掌門都是沉迷於武功的鑽研上，才一直沒有回到中土，並不是遭到殺害．事情的經過是這樣的．．．", 0, 1);
Talk(43, "什麼！有這等事！那這麼說來，你學到俠客神功囉．快將武功秘笈交出來，否則要你好看．", 43, 0);
Talk(0, "呦，翻臉不認人啦！當初還很高興我替上俠客島送死，如今卻．．．．．", 0, 1);
Talk(43, "廢話少說．", 43, 0);
if TryBattle(60) == true then goto label0 end;
    Dead();
    exit();
::label0::
    LightScene();
    ModifyEvent(-2, 5, -2, -2, 347, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 6, -2, -2, 347, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 7, -2, -2, 347, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 8, -2, -2, 347, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 9, -2, -2, 346, -1, -1, -2, -2, -2, -2, -2, -2);
    AddRepute(3);
exit();
