Talk(91, "小子，金輪寺暫時封寺，你要參觀就到別處．", 91, 0);
Talk(0, "大爺我就愛到處逛逛，你們這些禿子管不著．", 0, 1);
if TryBattle(99) == true then goto label0 end;
    Dead();
    exit();
::label0::
    ModifyEvent(-2, 5, -2, -2, 628, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 6, -2, -2, 628, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 7, -2, -2, 628, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 8, -2, -2, 628, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 9, -2, -2, 628, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 10, -2, -2, 628, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 11, -2, -2, 628, -1, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 20, -2, -2, -1, -1, 629, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 21, -2, -2, -1, -1, 629, -2, -2, -2, -2, -2, -2);
    ModifyEvent(-2, 22, -2, -2, -1, -1, 629, -2, -2, -2, -2, -2, -2);
    LightScene();
    AddRepute(1);
exit();
