Talk(0, "老婆婆，這島很美，您一個人住著嗎？", 0, 1);
Talk(15, "小子，來我島上尋晦氣的嗎？", 15, 0);
Talk(0, "沒的事，我只是四處旅遊，無意間來到這島上的．", 0, 1);
Talk(15, "說實話，你是那一派的弟子？到這島上來做什麼？", 15, 0);
Talk(0, "我無門無派，無師自通，自己四處”練練功”罷了．", 0, 1);
Talk(15, "自已四處練練？那好，我老太婆就來陪你玩玩．", 15, 0);
if AskBattle() == true then goto label0 end;
    ModifyEvent(-2, -2, -2, -2, 99, -1, -1, -2, -2, -2, -2, -2, -2);
    exit();
::label0::
    Talk(0, "好啊！閒來無事，就跟您老人家練練功增加些經驗點數吧．", 0, 1);
    if TryBattle(14) == false then goto label1 end;
        ModifyEvent(-2, -2, -2, -2, 100, -1, -1, -2, -2, -2, -2, -2, -2);
        SetSceneMap(-2, 1, 21, 17, 0);
        LightScene();
        Talk(15, "好小子，有你的．真是長江後浪推前浪．**你是來救王難姑的吧，既然打輸了你，老婆婆我就改天再尋他們的晦氣．", 15, 0);
        Talk(0, "＜什麼救不救人的？我都搞糊塗了 ＞", 0, 1);
        AddRepute(3);
        exit();
::label1::
        ModifyEvent(-2, -2, -2, -2, 99, -1, -1, -2, -2, -2, -2, -2, -2);
        LightScene();
        Talk(15, "看你資質挺好的，老婆婆我不想殺你，你走吧．", 15, 0);
exit();
